tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/poreSpaceReactiveTransport/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

lx0 -0.046;
ly0 -0.014;
lz0 -0.001;

lx1 0.046;
ly1 0.014;
lz1 0.001;
vertices
(
    ($lx0 $ly0 $lz0)
    ($lx1 $ly0 $lz0)
    ($lx1 $ly1 $lz0)
    ($lx0 $ly1 $lz0)
    ($lx0 $ly0 $lz1)
    ($lx1 $ly0 $lz1)
    ($lx1 $ly1 $lz1)
    ($lx0 $ly1 $lz1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (230 70 1) simpleGrading (1 1 1)
);


boundary
(
    walls
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
	
	inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
	
	outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
